iscsi_replicated_pg_256/iscsi_libaio_1024_randwrite_512k.log
iscsi_libaio_1024_randwrite_512k: (g=0): rw=randwrite, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=1024
fio-3.1
Starting 1 process

iscsi_libaio_1024_randwrite_512k: (groupid=0, jobs=1): err= 0: pid=1514373: Wed Jun 24 15:03:34 2020
  write: IOPS=313, BW=157MiB/s (165MB/s)(91.0GiB/600306msec)
    slat (usec): min=50, max=2222.2k, avg=3177.13, stdev=31499.56
    clat (msec): min=291, max=10125, avg=3252.25, stdev=1517.30
     lat (msec): min=364, max=10125, avg=3255.43, stdev=1518.20
    clat percentiles (msec):
     |  1.00th=[ 1787],  5.00th=[ 1921], 10.00th=[ 2022], 20.00th=[ 2140],
     | 30.00th=[ 2232], 40.00th=[ 2366], 50.00th=[ 2534], 60.00th=[ 2836],
     | 70.00th=[ 3540], 80.00th=[ 4530], 90.00th=[ 5738], 95.00th=[ 6611],
     | 99.00th=[ 7752], 99.50th=[ 7953], 99.90th=[ 8423], 99.95th=[ 8658],
     | 99.99th=[ 9060]
   bw (  KiB/s): min=14336, max=294912, per=100.00%, avg=183244.84, stdev=72458.48, samples=1047
   iops        : min=   28, max=  576, avg=357.87, stdev=141.53, samples=1047
  lat (msec)   : 500=0.03%, 750=0.07%, 1000=0.05%, 2000=8.99%, >=2000=90.86%
  cpu          : usr=1.87%, sys=1.75%, ctx=13475, majf=0, minf=243088
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,188407,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1024

Run status group 0 (all jobs):
  WRITE: bw=157MiB/s (165MB/s), 157MiB/s-157MiB/s (165MB/s-165MB/s), io=91.0GiB (98.8GB), run=600306-600306msec